app/controllers/activations_controller.rb

SELECT * FROM "users" WHERE (perishable_token = 'jJgbrQdXshAW7qGPBlX1' and updated_at > '2010-08-27 19:21:08') LIMIT 1
---
    def new
      @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)

SELECT * FROM "users" WHERE ("users"."id" = 8)
---
    def create
      @user = User.find(params[:id])