app/controllers/exception_controller.rb

  def edit
    @clients = Client.find(params[:id])

    @clients.notification = false

    if @clients.save
---
SELECT * FROM "clients" WHERE ("clients"."id" = 4)
UPDATE "clients" SET "updated_at" = '2010-09-09 14:16:28', "notification" = 'f' WHERE "id" = 4