app/controllers/exception_controller.rb

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def index
    @clients = Client.find(params[:id])