app/controllers/password_resets_controller.rb

  def create
     @user = User.find_by_email(params[:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'pablof@insignia4u.com') LIMIT 1

 def update
   @user.password = params[:user][:password]
   @user.password_confirmation = params[:user][:password_confirmation]
   if @user.save
---
UPDATE "users" SET "updated_at" = '2010-09-08 13:25:13', "perishable_token" = 'T5ygH26WqsxStGKDIzOT' WHERE "id" = 1

     def load_user_using_perishable_token
       @user = User.find_using_perishable_token(params[:id])
---
SELECT * FROM "users" WHERE (perishable_token = 'vD47xWbE8ewpmAUFKqs' and updated_at > '2010-09-08 12:53:08') LIMIT 1