app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "country", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "openid_identifier", "password_salt", "current_login_at", "full_name", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "state", "email", "active") VALUES('YHchLma6dw4L1pxyLyD', NULL, '2010-09-03 20:35:01', NULL, 'ccba0eb3b1e0a472502df16bfeec7e5836b95caae0c6970a963066b8ba09828f030eb8e19437c3b43ba1c183730b44c76471ac976de61b9d9ac4c825867d8550', 'gG7t8yDGG6Ema8TgHE1', '2010-09-03 20:35:01', 0, NULL, NULL, 'hUytsFWY9mExShN233Cf', NULL, NULL, '5f0dc19240df6cd5a16af2afc3ee3862825b03fe364deb01a955ea6d9c6f9031dbb877655f795008bc3697009a46a4241ebb8b6669d215369cdfdd1e7049d73a', 0, NULL, 'prueba2', NULL, NULL, 'pablo.moreiramora@gmail.com', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save